<!-- attach-outputs:plan-nodes-test.txt -->
  <!-- Output: plan-nodes-test.txt -->
  #### plan-nodes-test.txt 📖: `test: success, prod: success`

  **Last updated:** Mar 9, 2026, 12:57 PM UTC

  <details><summary>Show Contents</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # proxmox_virtual_environment_container.alloy["nuc-g2p-1"] must be replaced
-/+ resource "proxmox_virtual_environment_container" "alloy" {
      - environment_variables = {
          - "ALLOY_DEPLOY_MODE" = "docker"
          - "PATH"              = "/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin"
        } -> null
      ~ id                    = "500" -> (known after apply)
      ~ ipv4                  = {
          - "eth0" = "10.0.12.75"
        } -> (known after apply)
      ~ ipv6                  = {
          - "eth0" = "fe80::be24:11ff:fef8:203d"
        } -> (known after apply)
        tags                  = [
            "alloy",
            "monitoring",
        ]
      ~ unprivileged          = true -> false # forces replacement
      ~ vm_id                 = 500 -> 200 # forces replacement
        # (11 unchanged attributes hidden)

      - console {
          - enabled   = true -> null
          - tty_count = 2 -> null
          - type      = "console" -> null
        }

      ~ disk {
          - mount_options     = [] -> null
          ~ path_in_datastore = "local-lvm:vm-500-disk-0" -> (known after apply)
            # (5 unchanged attributes hidden)
        }

      - features {
          - fuse    = false -> null
          - keyctl  = false -> null
          - mount   = [] -> null
          - nesting = true -> null
        }

      ~ initialization {
          - entrypoint = "/bin/alloy run /var/lib/vz/snippets/alloy-proxmox.alloy '--storage.path=/var/lib/alloy/data' '--server.http.listen-addr=0.0.0.0:12345'" -> null
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      - memory {
          - dedicated = 512 -> null
          - swap      = 0 -> null
        }

      ~ mount_point { # forces replacement
          - mount_options     = [] -> null
          ~ path_in_datastore = "/" -> (known after apply)
            # (9 unchanged attributes hidden)
        }
      - mount_point { # forces replacement
          - acl               = false -> null
          - backup            = false -> null
          - mount_options     = [] -> null
          - path              = "/var/lib/vz/snippets" -> null
          - path_in_datastore = "/var/lib/vz/snippets" -> null
          - quota             = false -> null
          - read_only         = true -> null
          - replicate         = true -> null
          - shared            = false -> null
          - volume            = "/var/lib/vz/snippets" -> null # forces replacement
            # (1 unchanged attribute hidden)
        }

      ~ network_interface {
          ~ firewall    = true -> false
          ~ mac_address = "BC:24:11:F8:20:3D" -> (known after apply)
          ~ name        = "eth0" -> "net0"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # proxmox_virtual_environment_container.alloy["nuc-g2p-2"] must be replaced
-/+ resource "proxmox_virtual_environment_container" "alloy" {
      - environment_variables = {
          - "ALLOY_DEPLOY_MODE" = "docker"
          - "PATH"              = "/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin"
        } -> null
      ~ id                    = "501" -> (known after apply)
      ~ ipv4                  = {
          - "eth0" = "10.0.11.255"
        } -> (known after apply)
      ~ ipv6                  = {
          - "eth0" = "fe80::be24:11ff:fe2e:84b9"
        } -> (known after apply)
        tags                  = [
            "alloy",
            "monitoring",
        ]
      ~ unprivileged          = true -> false # forces replacement
      ~ vm_id                 = 501 -> 200 # forces replacement
        # (11 unchanged attributes hidden)

      - console {
          - enabled   = true -> null
          - tty_count = 2 -> null
          - type      = "console" -> null
        }

      ~ disk {
          - mount_options     = [] -> null
          ~ path_in_datastore = "local-lvm:vm-501-disk-0" -> (known after apply)
            # (5 unchanged attributes hidden)
        }

      - features {
          - fuse    = false -> null
          - keyctl  = false -> null
          - mount   = [] -> null
          - nesting = true -> null
        }

      ~ initialization {
          - entrypoint = "/bin/alloy run /var/lib/vz/snippets/alloy-proxmox.alloy '--storage.path=/var/lib/alloy/data' '--server.http.listen-addr=0.0.0.0:12345'" -> null
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      - memory {
          - dedicated = 512 -> null
          - swap      = 0 -> null
        }

      ~ mount_point { # forces replacement
          - mount_options     = [] -> null
          ~ path_in_datastore = "/" -> (known after apply)
            # (9 unchanged attributes hidden)
        }
      - mount_point { # forces replacement
          - acl               = false -> null
          - backup            = false -> null
          - mount_options     = [] -> null
          - path              = "/var/lib/vz/snippets" -> null
          - path_in_datastore = "/var/lib/vz/snippets" -> null
          - quota             = false -> null
          - read_only         = true -> null
          - replicate         = true -> null
          - shared            = false -> null
          - volume            = "/var/lib/vz/snippets" -> null # forces replacement
            # (1 unchanged attribute hidden)
        }

      ~ network_interface {
          ~ firewall    = true -> false
          ~ mac_address = "BC:24:11:2E:84:B9" -> (known after apply)
          ~ name        = "eth0" -> "net0"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # proxmox_virtual_environment_container.alloy["nuc-g3p-1"] must be replaced
-/+ resource "proxmox_virtual_environment_container" "alloy" {
      - environment_variables = {
          - "ALLOY_DEPLOY_MODE" = "docker"
          - "PATH"              = "/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin"
        } -> null
      ~ id                    = "502" -> (known after apply)
      ~ ipv4                  = {
          - "eth0" = "10.0.11.142"
        } -> (known after apply)
      ~ ipv6                  = {
          - "eth0" = "fe80::be24:11ff:fe1f:4f76"
        } -> (known after apply)
        tags                  = [
            "alloy",
            "monitoring",
        ]
      ~ unprivileged          = true -> false # forces replacement
      ~ vm_id                 = 502 -> 200 # forces replacement
        # (11 unchanged attributes hidden)

      - console {
          - enabled   = true -> null
          - tty_count = 2 -> null
          - type      = "console" -> null
        }

      ~ disk {
          - mount_options     = [] -> null
          ~ path_in_datastore = "local-lvm:vm-502-disk-0" -> (known after apply)
            # (5 unchanged attributes hidden)
        }

      - features {
          - fuse    = false -> null
          - keyctl  = false -> null
          - mount   = [] -> null
          - nesting = true -> null
        }

      ~ initialization {
          - entrypoint = "/bin/alloy run /var/lib/vz/snippets/alloy-proxmox.alloy '--storage.path=/var/lib/alloy/data' '--server.http.listen-addr=0.0.0.0:12345'" -> null
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      - memory {
          - dedicated = 512 -> null
          - swap      = 0 -> null
        }

      ~ mount_point { # forces replacement
          - mount_options     = [] -> null
          ~ path_in_datastore = "/" -> (known after apply)
            # (9 unchanged attributes hidden)
        }
      - mount_point { # forces replacement
          - acl               = false -> null
          - backup            = false -> null
          - mount_options     = [] -> null
          - path              = "/var/lib/vz/snippets" -> null
          - path_in_datastore = "/var/lib/vz/snippets" -> null
          - quota             = false -> null
          - read_only         = true -> null
          - replicate         = true -> null
          - shared            = false -> null
          - volume            = "/var/lib/vz/snippets" -> null # forces replacement
            # (1 unchanged attribute hidden)
        }

      ~ network_interface {
          ~ firewall    = true -> false
          ~ mac_address = "BC:24:11:1F:4F:76" -> (known after apply)
          ~ name        = "eth0" -> "net0"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # proxmox_virtual_environment_container.alloy["nuc-g3p-2"] must be replaced
-/+ resource "proxmox_virtual_environment_container" "alloy" {
      - environment_variables = {
          - "ALLOY_DEPLOY_MODE" = "docker"
          - "PATH"              = "/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin"
        } -> null
      ~ id                    = "503" -> (known after apply)
      ~ ipv4                  = {
          - "eth0" = "10.0.11.79"
        } -> (known after apply)
      ~ ipv6                  = {
          - "eth0" = "fe80::be24:11ff:fe73:cf27"
        } -> (known after apply)
        tags                  = [
            "alloy",
            "monitoring",
        ]
      ~ unprivileged          = true -> false # forces replacement
      ~ vm_id                 = 503 -> 200 # forces replacement
        # (11 unchanged attributes hidden)

      - console {
          - enabled   = true -> null
          - tty_count = 2 -> null
          - type      = "console" -> null
        }

      ~ disk {
          - mount_options     = [] -> null
          ~ path_in_datastore = "local-lvm:vm-503-disk-0" -> (known after apply)
            # (5 unchanged attributes hidden)
        }

      - features {
          - fuse    = false -> null
          - keyctl  = false -> null
          - mount   = [] -> null
          - nesting = true -> null
        }

      ~ initialization {
          - entrypoint = "/bin/alloy run /var/lib/vz/snippets/alloy-proxmox.alloy '--storage.path=/var/lib/alloy/data' '--server.http.listen-addr=0.0.0.0:12345'" -> null
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      - memory {
          - dedicated = 512 -> null
          - swap      = 0 -> null
        }

      ~ mount_point { # forces replacement
          - mount_options     = [] -> null
          ~ path_in_datastore = "/" -> (known after apply)
            # (9 unchanged attributes hidden)
        }
      - mount_point { # forces replacement
          - acl               = false -> null
          - backup            = false -> null
          - mount_options     = [] -> null
          - path              = "/var/lib/vz/snippets" -> null
          - path_in_datastore = "/var/lib/vz/snippets" -> null
          - quota             = false -> null
          - read_only         = true -> null
          - replicate         = true -> null
          - shared            = false -> null
          - volume            = "/var/lib/vz/snippets" -> null # forces replacement
            # (1 unchanged attribute hidden)
        }

      ~ network_interface {
          ~ firewall    = true -> false
          ~ mac_address = "BC:24:11:73:CF:27" -> (known after apply)
          ~ name        = "eth0" -> "net0"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # proxmox_virtual_environment_file.alloy_config["nuc-g2p-1"] must be replaced
-/+ resource "proxmox_virtual_environment_file" "alloy_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "alloy-proxmox.alloy" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "local:snippets/alloy-proxmox.alloy" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = <<-EOT # forces replacement
                // Alloy configuration for Proxmox host monitoring
                // Collects node_exporter metrics (including hwmon sensors) and system logs, forwarding to OTLP endpoints
                
              - // Node exporter for host system metrics (nesting exposes host /proc and /sys to the container)
              + // Node exporter for host system metrics
              + // This will collect hwmon metrics (temperature, fan speeds) from /sys/class/hwmon/
                prometheus.exporter.unix "node" {
              -   procfs_path = "/proc"
              -   sysfs_path  = "/sys"
              +   procfs_path = "/host/proc"
              +   sysfs_path  = "/host/sys"
                  rootfs_path = "/host"
                }
                
                // OTLP HTTP exporter for tiles-test cluster
                otelcol.exporter.otlphttp "tiles_test" {
                  client {
                    endpoint = "https://otlp.tiles-test.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles-test",
                    }
                  }
                }
                
                // OTLP HTTP exporter for tiles cluster
                otelcol.exporter.otlphttp "tiles" {
                  client {
                    endpoint = "https://otlp.tiles.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles",
                    }
                  }
                }
                
                // Scrape node exporter metrics (system performance + hwmon sensors) and convert to OTLP format
                prometheus.scrape "node" {
                  // This job_name lets us re-use the node_exporter_mixin dashboards
                  job_name = "integrations/node_exporter"
                  targets    = prometheus.exporter.unix.node.targets
                  forward_to = [otelcol.receiver.prometheus.main.receiver]
                }
                // TODO: Consider dropping metrics and labels like
                // https://github.com/grafana/k8s-monitoring-helm/blob/ea357b0204031a05adc478f4778875c6122b0a98/charts/k8s-monitoring/charts/feature-cluster-metrics/templates/_node_exporter.alloy.tpl
                // which really prunes a lot.
                
                // Convert Prometheus to OTLP
                otelcol.receiver.prometheus "main" {
                  output {
                    metrics = [otelcol.processor.attributes.main.input]
                  }
                }
                
                // Add cluster label to both metrics and logs, forwarding to both clusters
                otelcol.processor.attributes "main" {
                  action {
                    key    = "cluster"
                    value  = "bond"
                    action = "upsert"
                  }
                
                  action {
                    key    = "hostname"
                    value  = "nuc-g2p-1"
                    action = "upsert"
                  }
                
                  output {
                    metrics = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                    logs = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                  }
                }
                
                // Log collection from host
                // Proxmox uses systemd, so we can collect from journald or traditional syslog
                loki.source.file "syslog" {
                  targets = [
                    {
                      __path__ = "/host/var/log/syslog",
                      job      = "proxmox-syslog",
                      host     = "nuc-g2p-1",
                    },
                    {
                      __path__ = "/host/var/log/messages",
                      job      = "proxmox-messages",
                      host     = "nuc-g2p-1",
                    },
                    {
                      __path__ = "/host/var/log/auth.log",
                      job      = "proxmox-auth",
                      host     = "nuc-g2p-1",
                    },
                    {
                      __path__ = "/host/var/log/daemon.log",
                      job      = "proxmox-daemon",
                      host     = "nuc-g2p-1",
                    },
                  ]
                  forward_to = [otelcol.receiver.loki.main.receiver]
                }
                
                // Convert Loki logs to OTLP
                otelcol.receiver.loki "main" {
                  output {
                    logs = [otelcol.processor.attributes.main.input]
                  }
                }
            EOT
          ~ file_name = "alloy-proxmox.alloy" -> "alloy-proxmox-nuc-g2p-1.alloy" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # proxmox_virtual_environment_file.alloy_config["nuc-g2p-2"] must be replaced
-/+ resource "proxmox_virtual_environment_file" "alloy_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "alloy-proxmox.alloy" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "local:snippets/alloy-proxmox.alloy" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = <<-EOT # forces replacement
                // Alloy configuration for Proxmox host monitoring
                // Collects node_exporter metrics (including hwmon sensors) and system logs, forwarding to OTLP endpoints
                
              - // Node exporter for host system metrics (nesting exposes host /proc and /sys to the container)
              + // Node exporter for host system metrics
              + // This will collect hwmon metrics (temperature, fan speeds) from /sys/class/hwmon/
                prometheus.exporter.unix "node" {
              -   procfs_path = "/proc"
              -   sysfs_path  = "/sys"
              +   procfs_path = "/host/proc"
              +   sysfs_path  = "/host/sys"
                  rootfs_path = "/host"
                }
                
                // OTLP HTTP exporter for tiles-test cluster
                otelcol.exporter.otlphttp "tiles_test" {
                  client {
                    endpoint = "https://otlp.tiles-test.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles-test",
                    }
                  }
                }
                
                // OTLP HTTP exporter for tiles cluster
                otelcol.exporter.otlphttp "tiles" {
                  client {
                    endpoint = "https://otlp.tiles.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles",
                    }
                  }
                }
                
                // Scrape node exporter metrics (system performance + hwmon sensors) and convert to OTLP format
                prometheus.scrape "node" {
                  // This job_name lets us re-use the node_exporter_mixin dashboards
                  job_name = "integrations/node_exporter"
                  targets    = prometheus.exporter.unix.node.targets
                  forward_to = [otelcol.receiver.prometheus.main.receiver]
                }
                // TODO: Consider dropping metrics and labels like
                // https://github.com/grafana/k8s-monitoring-helm/blob/ea357b0204031a05adc478f4778875c6122b0a98/charts/k8s-monitoring/charts/feature-cluster-metrics/templates/_node_exporter.alloy.tpl
                // which really prunes a lot.
                
                // Convert Prometheus to OTLP
                otelcol.receiver.prometheus "main" {
                  output {
                    metrics = [otelcol.processor.attributes.main.input]
                  }
                }
                
                // Add cluster label to both metrics and logs, forwarding to both clusters
                otelcol.processor.attributes "main" {
                  action {
                    key    = "cluster"
                    value  = "bond"
                    action = "upsert"
                  }
                
                  action {
                    key    = "hostname"
                    value  = "nuc-g2p-2"
                    action = "upsert"
                  }
                
                  output {
                    metrics = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                    logs = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                  }
                }
                
                // Log collection from host
                // Proxmox uses systemd, so we can collect from journald or traditional syslog
                loki.source.file "syslog" {
                  targets = [
                    {
                      __path__ = "/host/var/log/syslog",
                      job      = "proxmox-syslog",
                      host     = "nuc-g2p-2",
                    },
                    {
                      __path__ = "/host/var/log/messages",
                      job      = "proxmox-messages",
                      host     = "nuc-g2p-2",
                    },
                    {
                      __path__ = "/host/var/log/auth.log",
                      job      = "proxmox-auth",
                      host     = "nuc-g2p-2",
                    },
                    {
                      __path__ = "/host/var/log/daemon.log",
                      job      = "proxmox-daemon",
                      host     = "nuc-g2p-2",
                    },
                  ]
                  forward_to = [otelcol.receiver.loki.main.receiver]
                }
                
                // Convert Loki logs to OTLP
                otelcol.receiver.loki "main" {
                  output {
                    logs = [otelcol.processor.attributes.main.input]
                  }
                }
            EOT
          ~ file_name = "alloy-proxmox.alloy" -> "alloy-proxmox-nuc-g2p-2.alloy" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # proxmox_virtual_environment_file.alloy_config["nuc-g3p-1"] must be replaced
-/+ resource "proxmox_virtual_environment_file" "alloy_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "alloy-proxmox.alloy" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "local:snippets/alloy-proxmox.alloy" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = <<-EOT # forces replacement
                // Alloy configuration for Proxmox host monitoring
                // Collects node_exporter metrics (including hwmon sensors) and system logs, forwarding to OTLP endpoints
                
              - // Node exporter for host system metrics (nesting exposes host /proc and /sys to the container)
              + // Node exporter for host system metrics
              + // This will collect hwmon metrics (temperature, fan speeds) from /sys/class/hwmon/
                prometheus.exporter.unix "node" {
              -   procfs_path = "/proc"
              -   sysfs_path  = "/sys"
              +   procfs_path = "/host/proc"
              +   sysfs_path  = "/host/sys"
                  rootfs_path = "/host"
                }
                
                // OTLP HTTP exporter for tiles-test cluster
                otelcol.exporter.otlphttp "tiles_test" {
                  client {
                    endpoint = "https://otlp.tiles-test.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles-test",
                    }
                  }
                }
                
                // OTLP HTTP exporter for tiles cluster
                otelcol.exporter.otlphttp "tiles" {
                  client {
                    endpoint = "https://otlp.tiles.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles",
                    }
                  }
                }
                
                // Scrape node exporter metrics (system performance + hwmon sensors) and convert to OTLP format
                prometheus.scrape "node" {
                  // This job_name lets us re-use the node_exporter_mixin dashboards
                  job_name = "integrations/node_exporter"
                  targets    = prometheus.exporter.unix.node.targets
                  forward_to = [otelcol.receiver.prometheus.main.receiver]
                }
                // TODO: Consider dropping metrics and labels like
                // https://github.com/grafana/k8s-monitoring-helm/blob/ea357b0204031a05adc478f4778875c6122b0a98/charts/k8s-monitoring/charts/feature-cluster-metrics/templates/_node_exporter.alloy.tpl
                // which really prunes a lot.
                
                // Convert Prometheus to OTLP
                otelcol.receiver.prometheus "main" {
                  output {
                    metrics = [otelcol.processor.attributes.main.input]
                  }
                }
                
                // Add cluster label to both metrics and logs, forwarding to both clusters
                otelcol.processor.attributes "main" {
                  action {
                    key    = "cluster"
                    value  = "bond"
                    action = "upsert"
                  }
                
                  action {
                    key    = "hostname"
                    value  = "nuc-g3p-1"
                    action = "upsert"
                  }
                
                  output {
                    metrics = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                    logs = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                  }
                }
                
                // Log collection from host
                // Proxmox uses systemd, so we can collect from journald or traditional syslog
                loki.source.file "syslog" {
                  targets = [
                    {
                      __path__ = "/host/var/log/syslog",
                      job      = "proxmox-syslog",
                      host     = "nuc-g3p-1",
                    },
                    {
                      __path__ = "/host/var/log/messages",
                      job      = "proxmox-messages",
                      host     = "nuc-g3p-1",
                    },
                    {
                      __path__ = "/host/var/log/auth.log",
                      job      = "proxmox-auth",
                      host     = "nuc-g3p-1",
                    },
                    {
                      __path__ = "/host/var/log/daemon.log",
                      job      = "proxmox-daemon",
                      host     = "nuc-g3p-1",
                    },
                  ]
                  forward_to = [otelcol.receiver.loki.main.receiver]
                }
                
                // Convert Loki logs to OTLP
                otelcol.receiver.loki "main" {
                  output {
                    logs = [otelcol.processor.attributes.main.input]
                  }
                }
            EOT
          ~ file_name = "alloy-proxmox.alloy" -> "alloy-proxmox-nuc-g3p-1.alloy" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

  # proxmox_virtual_environment_file.alloy_config["nuc-g3p-2"] must be replaced
-/+ resource "proxmox_virtual_environment_file" "alloy_config" {
      + file_modification_date = (known after apply)
      ~ file_name              = "alloy-proxmox.alloy" -> (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      ~ id                     = "local:snippets/alloy-proxmox.alloy" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ source_raw {
          ~ data      = <<-EOT # forces replacement
                // Alloy configuration for Proxmox host monitoring
                // Collects node_exporter metrics (including hwmon sensors) and system logs, forwarding to OTLP endpoints
                
              - // Node exporter for host system metrics (nesting exposes host /proc and /sys to the container)
              + // Node exporter for host system metrics
              + // This will collect hwmon metrics (temperature, fan speeds) from /sys/class/hwmon/
                prometheus.exporter.unix "node" {
              -   procfs_path = "/proc"
              -   sysfs_path  = "/sys"
              +   procfs_path = "/host/proc"
              +   sysfs_path  = "/host/sys"
                  rootfs_path = "/host"
                }
                
                // OTLP HTTP exporter for tiles-test cluster
                otelcol.exporter.otlphttp "tiles_test" {
                  client {
                    endpoint = "https://otlp.tiles-test.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles-test",
                    }
                  }
                }
                
                // OTLP HTTP exporter for tiles cluster
                otelcol.exporter.otlphttp "tiles" {
                  client {
                    endpoint = "https://otlp.tiles.symmatree.com"
                    headers = {
                      "X-Scope-OrgID" = "tiles",
                    }
                  }
                }
                
                // Scrape node exporter metrics (system performance + hwmon sensors) and convert to OTLP format
                prometheus.scrape "node" {
                  // This job_name lets us re-use the node_exporter_mixin dashboards
                  job_name = "integrations/node_exporter"
                  targets    = prometheus.exporter.unix.node.targets
                  forward_to = [otelcol.receiver.prometheus.main.receiver]
                }
                // TODO: Consider dropping metrics and labels like
                // https://github.com/grafana/k8s-monitoring-helm/blob/ea357b0204031a05adc478f4778875c6122b0a98/charts/k8s-monitoring/charts/feature-cluster-metrics/templates/_node_exporter.alloy.tpl
                // which really prunes a lot.
                
                // Convert Prometheus to OTLP
                otelcol.receiver.prometheus "main" {
                  output {
                    metrics = [otelcol.processor.attributes.main.input]
                  }
                }
                
                // Add cluster label to both metrics and logs, forwarding to both clusters
                otelcol.processor.attributes "main" {
                  action {
                    key    = "cluster"
                    value  = "bond"
                    action = "upsert"
                  }
                
                  action {
                    key    = "hostname"
                    value  = "nuc-g3p-2"
                    action = "upsert"
                  }
                
                  output {
                    metrics = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                    logs = [
                      otelcol.exporter.otlphttp.tiles_test.input,
                      otelcol.exporter.otlphttp.tiles.input,
                    ]
                  }
                }
                
                // Log collection from host
                // Proxmox uses systemd, so we can collect from journald or traditional syslog
                loki.source.file "syslog" {
                  targets = [
                    {
                      __path__ = "/host/var/log/syslog",
                      job      = "proxmox-syslog",
                      host     = "nuc-g3p-2",
                    },
                    {
                      __path__ = "/host/var/log/messages",
                      job      = "proxmox-messages",
                      host     = "nuc-g3p-2",
                    },
                    {
                      __path__ = "/host/var/log/auth.log",
                      job      = "proxmox-auth",
                      host     = "nuc-g3p-2",
                    },
                    {
                      __path__ = "/host/var/log/daemon.log",
                      job      = "proxmox-daemon",
                      host     = "nuc-g3p-2",
                    },
                  ]
                  forward_to = [otelcol.receiver.loki.main.receiver]
                }
                
                // Convert Loki logs to OTLP
                otelcol.receiver.loki "main" {
                  output {
                    logs = [otelcol.processor.attributes.main.input]
                  }
                }
            EOT
          ~ file_name = "alloy-proxmox.alloy" -> "alloy-proxmox-nuc-g3p-2.alloy" # forces replacement
            # (1 unchanged attribute hidden)
        }
    }

Plan: 8 to add, 0 to change, 8 to destroy.

  ```

  </details>
  
  